def 種一棵聖誕樹(高度):
    
    # 第一行掛星星
    大星星 = '*'
    天空 = ' ' * (高度 - 1)
    print(天空 + 大星星)
    
    for i in range(1, 高度):
        # 1. 長出葉子
        葉子 = ['|'] * (2 * i + 1)
        
        # 2. 修剪左邊的葉子
        葉子[0] = '/'
        
        # 3. 修剪右邊的葉子
        葉子[-1] = '\\'
        
        # 4. 掛裝飾品
        裝飾品 = '*'
        for j in range(1, len(葉子) - 1):
            if j % 2 == 0:
                葉子[j] = 裝飾品
        
        天空 = ' ' * (高度 - i - 1)
        print(天空 + ''.join(葉子))
    
    # 5. 樹幹（根據最長那行來置中）
    最大寬度 = 2 * (高度 - 1) + 1
    
    樹幹 = '| | |'
    留白 = ' ' * int((最大寬度 - len(樹幹)) // 2)
    print(留白 + 樹幹)

    
    # 6. 盆栽
    盆栽 = '[SantaCode]'
    留白 = ' ' * int((最大寬度 - len(盆栽)) // 2)
    print(留白 + 盆栽)

if __name__ == "__main__":
    種一棵聖誕樹(6)